Documents/МГС_ВыпускБаллонов_.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МГС_ВыпускБаллонов_</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МГС_ВыпускБаллонов_</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВыпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МГС_ТипыВыпускаБаллонов_</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБаллонов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБаллоновВВыпуске</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартииБаллоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипБаллона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_ТипыБаллонов_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закрыта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон7</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон8</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон9</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон10</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон11</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон12</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон13</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон14</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон15</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон16</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон17</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон18</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон19</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон20</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйЗаПартию</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колпак</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кольца</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПартии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБаллоновВПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МГС_ВыпускБаллонов_/Forms/ФормаПартии/Ext/Form/Module.bsl
&НаСервереБезконтекста
Функция ПолучитьДатуАттестации(Баллон)
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_АттестацияБаллоновСрезПоследних.ДатаСледующейАттестации КАК ДатаСледующейАттестации
		|ИЗ
		|	РегистрСведений.МГС_АттестацияБаллонов.СрезПоследних(, Баллон = &Баллон) КАК МГС_АттестацияБаллоновСрезПоследних";
	
	Запрос.УстановитьПараметр("Баллон", Баллон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат  ВыборкаДетальныеЗаписи.ДатаСледующейАттестации
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	НомерПартии = Параметры.НомерПартии;
	ТипБаллона = Параметры.ТипБаллона;
	ТипВыпуска = Параметры.ТипВыпуска;
	Закрыта  = Параметры.Закрыта;
	Колпак  = Параметры.Колпак;
	Кольца  = Параметры.Кольца;
	ПереченьБаллонов= Параметры.ПереченьБаллонов;
	ПереченьВесов= Параметры.ПереченьВесов;
	ОтветственныйЗаПартию = Параметры.ОтветственныйЗаПартию;
	Для Н =1 По 20 Цикл
		Если ЗначениеЗаполнено( ПереченьБаллонов[Н-1]) Тогда
			НоваяСтрокаБаллоны =  Баллоны.Добавить();
			НоваяСтрокаБаллоны.Баллон = ПереченьБаллонов[Н-1];
			НоваяСтрокаБаллоны.Вес =ПереченьВесов[Н-1];
			НоваяСтрокаБаллоны.ДатаАттестации =ПолучитьДатуАттестации(НоваяСтрокаБаллоны.Баллон);
			НоваяСтрокаБаллоны.НомерСтроки = Н; 
		КонецЕсли;		
	КонецЦикла;
	ПеренестиВДокумент = Ложь;
	ОбновитьТекстКнопкиЗакрытьПартию()
КонецПроцедуры




&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
	
	Если ПеренестиВДокумент Тогда		
		// Вставить содержимое обработчика.
		СтруктураРезультат = Новый Структура();
		СтруктураРезультат.Вставить("НомерПартии", НомерПартии);
		СтруктураРезультат.Вставить("ТипБаллона",               ТипБаллона);
		СтруктураРезультат.Вставить("ОтветственныйЗаПартию",               ОтветственныйЗаПартию);
		СтруктураРезультат.Вставить("Закрыта",               Закрыта);
		СтруктураРезультат.Вставить("Колпак",               Колпак);
		СтруктураРезультат.Вставить("Кольца",               Кольца);
		ПереченьБаллонов = Новый Массив;
		ПереченьВесов = Новый Массив;
		Для Н =1 По 20 Цикл
			Если Н<=Баллоны.Количество() Тогда
				строкаБаллон = Баллоны[Н-1];
				ПереченьБаллонов.Добавить(строкаБаллон.Баллон);
				ПереченьВесов.Добавить(строкаБаллон.Вес);
			Иначе
				ПереченьБаллонов.Добавить(Неопределено);
				ПереченьВесов.Добавить(0);
			КонецЕсли;
		КонецЦикла;
		СтруктураРезультат.Вставить("ПереченьБаллонов", ПереченьБаллонов);
		СтруктураРезультат.Вставить("ПереченьВесов", ПереченьВесов);
		
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	// Вставить содержимое обработчика.
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

Процедура ОбновитьТекстКнопкиЗакрытьПартию()
	Если Закрыта Тогда
		Элементы.ЗакрытьПартию.Заголовок = "Открыть партию"
	Иначе
		Элементы.ЗакрытьПартию.Заголовок = "Закрыть партию"
	КонецЕсли;
КонецПроцедуры

&НаСервереБезконтекста
Функция ЭтоМедицинскийВыпуск(Тип)
	Если Тип = Справочники.МГС_ТипыВыпускаБаллонов.Медицинский Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗакрытьПартию(Команда)
	// Вставить содержимое обработчика.
	МожноЗакрытьПартию = Истина;
	Если ЭтоМедицинскийВыпуск(ТипВыпуска) Тогда
		Если Баллоны.Количество()<>20 Тогда
			ПоказатьПредупреждение(,"Для закрытия партии нужно указать 20 баллонов, сейчас указано " + Баллоны.Количество());
			МожноЗакрытьПартию = Ложь;
		КонецЕсли;
	КонецЕсли;	
		
	Если Не Закрыта и МожноЗакрытьПартию Тогда
		Закрыта = Истина 
	ИначеЕсли Закрыта Тогда
		Закрыта = Ложь
	КонецЕсли;
	
	ОбновитьТекстКнопкиЗакрытьПартию()
КонецПроцедуры

&НаКлиенте
Процедура БаллоныБаллонПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	//Баллоны.Количество()
	ТекущиеДанные = Элементы.Баллоны.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Баллоны.ТекущаяСтрока;
	ТекущиеДанные.ДатаАттестации = ПолучитьДатуАттестации(ТекущиеДанные.Баллон);
	ТекущиеДанные.НомерСтроки = Баллоны.Количество(); 
КонецПроцедуры

&НаКлиенте
Процедура БаллоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
	Если Баллоны.Количество()>= 20 Тогда
			ПоказатьПредупреждение(,"Количество строк превышает 20 " );	
			Отказ = Истина
	КонецЕсли;
КонецПроцедуры
